InformationRegisters/КР_ИнтеграционнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ИнтеграционнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_СтатусыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Логирование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибочныеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьСообщенияОтСебя</Name>
					<Comment>#3530</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючИнтеграции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ИнтеграционнаяИнформация/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительности.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --> Евлахов Игорь Николаевич (Начало) 23.08.2023
	// Задача #3069
	злСобытияФормОценкаПроизводительностиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	// <-- Евлахов Игорь Николаевич (Конец) 23.08.2023
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаписьОшибочныеСообщения = ТекущийОбъект.ОшибочныеСообщения.Получить();	
	Если ТипЗнч(ЗаписьОшибочныеСообщения) = Тип("ТаблицаЗначений") Тогда
		ОшибочныеСообщения.Загрузить(ЗаписьОшибочныеСообщения);		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОшибочныеСообщения = Новый ХранилищеЗначения(ОшибочныеСообщения.Выгрузить(), Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	ОбработатьСообщениеНаСервере();
	Элементы.ОшибочныеСообщения.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьСообщениеНаСервере()
	
	ТекСтрока = Элементы.ОшибочныеСообщения.ТекущаяСтрока; 
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = ОшибочныеСообщения.НайтиПоИдентификатору(ТекСтрока);
	
	ИнтеграционнаяИнформация = Новый Структура;
	ИнтеграционнаяИнформация.Вставить("Логирование", "");
	ИнтеграционнаяИнформация.Вставить("ЕстьОшибка", Ложь);
	ИнтеграционнаяИнформация.Вставить("ПолученоСообщений", 0);
	ИнтеграционнаяИнформация.Вставить("ОтправленоСообщений", 0);
	ИнтеграционнаяИнформация.Вставить("КоличествоОшибок", 0);
	ИнтеграционнаяИнформация.Вставить("УточненноеСостояние", Неопределено);
	ИнтеграционнаяИнформация.Вставить("СобытиеЖурналаРегистрации", "RabbitMQ.ИнтеграционнаяИнформация");
// << 18.12.2023 Петухов А.В., Фактор, #3530
	ИнтеграционнаяИнформация.Вставить("ЕстьСообщенияОтСебя", Ложь);
// >> 18.12.2023 Петухов А.В., Фактор, #3530
	
	ДанныеИБ = КР_ОбменRabbitОбщиеМеханизмыПовтИсп.ПолучитьТекущуюИнформационнуюБазу();
	ТекущаяИБ = ДанныеИБ.Ссылка;
	НастройкиПодключения = КР_ОбменRabbitОбщиеМеханизмыПовтИсп.ПолучитьНастройкиПодключенияКRabbit(ТекущаяИБ);
	
	ИнтеграционнаяИнформация.Вставить("ТекущаяИБ", ТекущаяИБ);
	ИнтеграционнаяИнформация.Вставить("НастройкиПодключения", НастройкиПодключения);
	
	Если КР_ОбменRabbitОбработкаСообщенийОбмена.ЗарегистрироватьВходящееСообщение(
			ТекДанные.ИмяОчереди, 
			ТекДанные.ВходящееСообщение, 
			ИнтеграционнаяИнформация,
			ТекДанные.ТекстОшибки) Тогда			
			
		ТекСтрока = ОшибочныеСообщения.НайтиПоИдентификатору(ТекДанные.ПолучитьИдентификатор());
		ОшибочныеСообщения.Удалить(ТекСтрока);
		
		Запись.ПолученоСообщений = Запись.ПолученоСообщений + 1;
		Запись.КоличествоОшибок = Запись.КоличествоОшибок - 1;
			
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

#КонецОбласти
